fabrika/src/InformationRegisters/ДДС/ДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДДС</name>
  <comment>Хранит данные по ДДС холдинга</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СконвертированнаяСумма</name>
    <comment>Сумма после конвертации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньВДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерВБухгалтерии</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <comment>Плановая дата прихода</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипДвиженияДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ПолучателиДДС</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПлатежа</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/InformationRegisters/ЗапрещённыеСтраны/ЗапрещённыеСтраны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапрещённыеСтраны</name>
  <comment>Перечень банков и стран, в которые с этих банков нельзя платить</comment>
  <dimensions>
    <name>Банк</name>
    <comment>ID банка отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗапрещённаяСтрана</name>
    <comment>Запрещённая страна </comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/Enums/ТипДвиженияДДС/ТипДвиженияДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДвиженияДДС</name>
  <enumValues>
    <name>ОстатокНаНачало</name>
  </enumValues>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>ОстатокНаКонец</name>
  </enumValues>
</mdclass:Enum>

fabrika/src/CommonModules/ДДС_Сервер/Module.bsl
//////////////////////////////////////ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ ДДС//////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////



////Дима 27.10.2015 17:32:16////Запись валютного рассчёта в подсистему ДДС
Процедура ЗаписьВалютногоРассчётаВДДСПриПроведении(Источник, Отказ) Экспорт
	
	Если НЕ Источник.Контрагент.ВалютныйРассчёт И НЕ Источник.Организация.ВалютныйРассчёт  Тогда
		возврат;
	КонецЕсли;	
	
	ЗаписатьВРегистрДДС(Отказ, Источник);
	

КонецПроцедуры
//конец Дима


////Дима 28.10.2015 12:36:54////Удаление валютного рассчёта из подсистемы ДДС
Процедура УдалениеВалютногоРассчётаИзДДСПередУдалением(Источник, Отказ) Экспорт
	
	Если НЕ Источник.Контрагент.ВалютныйРассчёт Тогда
		возврат;
	КонецЕсли;	
	
	ЗаписатьВРегистрДДС(Отказ, Источник, Истина);
	
	
КонецПроцедуры
//конец Дима


//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>



////Дима 08.06.2016 12:01:14////Заполнить запись регистра из источника
Процедура ЗаписатьВРегистрДДС(Отказ, Источник, Удаление = Ложь)
	
	ДДС = РегистрыСведений.ДДС.СоздатьНаборЗаписей();
	ТаблицаЗаписи = ДДС.ВыгрузитьКолонки();
	ТаблицаЗаписи.Колонки.Добавить("ПутьКРеквизиту", Новый ОписаниеТипов("Строка", ,
													 Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная))); 
	
	НоваяЗапись = ТаблицаЗаписи.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Источник);
	
	НоваяЗапись.Период = НачалоДня(Источник.Дата);
	НоваяЗапись.Получатель = Источник.Контрагент;
	НоваяЗапись.НомерПлатежа = Источник.Ссылка;
	НоваяЗапись.НомерВБухгалтерии = ПолучитьНомерВБухгалтерии(ДДС, Источник);
	НоваяЗапись.ТипДвижения = Перечисления.ТипДвиженияДДС.Списание;
	НоваяЗапись.ПутьКРеквизиту = "Объект.Контрагент";
	
	
	НоваяЗапись.ДеньВДень = ?(НоваяЗапись.СчетОрганизации.Бик = НоваяЗапись.СчетКонтрагента.Бик, Истина, Ложь);
	
	
	Попытка
		НоваяЗапись.ДатаПоступления = Источник.ДополнительныеСвойства.ДатаПрихода;
	Исключение
	КонецПопытки;
		
	Для Счетчик = 0 По Источник.Боркин.Количество() - 1 Цикл
		
		ЗаписьТЗ = ТаблицаЗаписи.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьТЗ, НоваяЗапись,, "СчетКонтрагента, ДоговорыКонтрагентов");
		
		строка = Источник.Боркин[Счетчик];
		ЗаписьТЗ.Организация = Строка.Организация;
		ЗаписьТЗ.СчетОрганизации = Строка.СчетОрганизации;
		ЗаписьТЗ.Получатель = Строка.Контрагент;
		ЗаписьТЗ.Период = Строка.ДатаПрихода;
		ЗаписьТЗ.Сумма = Строка.Сумма;
		ЗаписьТЗ.ТипДвижения = Перечисления.ТипДвиженияДДС.Поступление;
		ЗаписьТЗ.ДеньВДень = ?(ЗаписьТЗ.СчетОрганизации.Бик = НоваяЗапись.СчетКонтрагента.Бик, Истина, Ложь);
		ЗаписьТЗ.ПутьКРеквизиту = "Объект.Боркин[" + строка(Счетчик) + "].Контрагент";
		
	КонецЦикла;	
	
	Если Удаление Тогда
		ТаблицаЗаписи.ЗаполнитьЗначения(0, "Сумма");
	КонецЕсли;	
	
	
	//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
		
	
	//Запишем данные в базу с помощью обработки
	ОбработкаДДС = Обработки.ЗаполнениеРегистраДДС.Создать();
			
	ПоляУдаления = Новый Массив;
	ПоляУдаления.Добавить("НомерПлатежа");
	
	
	
	//
	Отказ = НЕ ОбработкаДДС.ПроверитьНаСоответствиеРегиструНастройкаПолей(ТаблицаЗаписи);
	
	Если НЕ Отказ Тогда
		
		Попытка
			ОбработкаДДС.ЗаполнитьНаборДвижений(ТаблицаЗаписи, ПоляУдаления, Новый УникальныйИдентификатор);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	

	
КонецПроцедуры
//конец Дима



////Дима 01.08.2017 16:49:08////
//Проверяет возможность оплаты поставщику со счёта организации (актально для Глоссаб)
Функция ПроверитьСчётНаПолучателя(Счёт, КодСтраныПолучателя) Экспорт

	ЗапрещённыеСтраны = РегистрыСведений.ЗапрещённыеСтраны.СоздатьНаборЗаписей();
	ЗапрещённыеСтраны.Отбор.Банк.Установить(Счёт.Бик);
	ЗапрещённыеСтраны.Прочитать();
	
	Если ЗапрещённыеСтраны.Количество() > 0 Тогда
		Для Каждого Запись Из ЗапрещённыеСтраны Цикл
			Если Запись.ЗапрещённаяСтрана.Код = КодСтраныПолучателя Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции
//конец Дима


Функция ПолучитьНомерВБухгалтерии(ДДС, Источник)

	ДДС.Отбор.НомерПлатежа.Установить(Источник.Ссылка);
	ДДС.Прочитать();
	
	Если ДДС.Количество() > 0 Тогда
		Возврат ДДС[0].НомерВБухгалтерии;
	КонецЕсли;	

КонецФункции // ПолучитьНомерПлатежа()
